#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

#### Preview environment 🔗
[https://9700f9b5e832768ec46384fba662d677-skjer.bekk.dev/](https://9700f9b5e832768ec46384fba662d677-skjer.bekk.dev/)

<details><summary>Show plan for apply after merge to master</summary>

```hcl

terraform
Acquiring state lock. This may take a few moments...
module.aws-deploy.random_string.suffix: Refreshing state... [id=qEfYxm4Yp5ww8yLZNIUznb3WEcouCvaY]
module.aws-deploy.data.aws_vpc.selected: Reading...
module.aws-deploy.data.aws_lb_listener.selected: Reading...
module.aws-deploy.data.aws_iam_role.ecs_task_execution_role: Reading...
module.aws-deploy.data.aws_ecs_cluster.selected: Reading...
module.aws-deploy.data.aws_secretsmanager_secret.main[0]: Reading...
module.aws-deploy.data.aws_security_group.selected: Reading...
module.aws-deploy.data.aws_region.current: Reading...
module.aws-deploy.data.aws_route53_zone.selected: Reading...
module.aws-deploy.data.aws_lb.selected: Reading...
module.aws-deploy.data.aws_iam_role.ecs_task_role: Reading...
module.aws-deploy.data.aws_region.current: Read complete after 0s [id=eu-central-1]
module.aws-deploy.data.aws_iam_role.ecs_task_role: Read complete after 0s [id=bekk-ecsTaskRole-dev]
module.aws-deploy.data.aws_iam_role.ecs_task_execution_role: Read complete after 0s [id=bekk-ecsTaskExecutionRole-dev]
module.aws-deploy.data.aws_security_group.selected: Read complete after 0s [id=sg-097e0d70b6ec82ec0]
module.aws-deploy.data.aws_ecs_cluster.selected: Read complete after 0s [id=arn:aws:ecs:eu-central-1:882089634282:cluster/bekk-ecs-cluster-dev]
module.aws-deploy.data.aws_secretsmanager_secret.main[0]: Read complete after 0s [id=arn:aws:secretsmanager:eu-central-1:882089634282:secret:bekk-arrangement-svc-dev-FhTZ4v]
module.aws-deploy.aws_ecs_task_definition.main: Refreshing state... [id=bekk-arrangement-svc-dev]
module.aws-deploy.data.aws_route53_zone.selected: Read complete after 0s [id=Z04411953P8CDQG39NSHW]
module.aws-deploy.data.aws_lb_listener.selected: Read complete after 0s [id=arn:aws:elasticloadbalancing:eu-central-1:882089634282:listener/app/bekk-lb-ecs-dev/6d410fcf59ca9e6f/da09c5a7670ad5a8]
module.aws-deploy.data.aws_lb.selected: Read complete after 0s [id=arn:aws:elasticloadbalancing:eu-central-1:882089634282:loadbalancer/app/bekk-lb-ecs-dev/6d410fcf59ca9e6f]
module.aws-deploy.data.aws_vpc.selected: Read complete after 0s [id=vpc-0942da75cd65bf8e0]
module.aws-deploy.aws_lb_target_group.main: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:882089634282:targetgroup/dev-qEfYxm4Yp5ww8yLZNIUznb3WEco/05fced12fd9f0a78]
module.aws-deploy.data.aws_subnets.private: Reading...
module.aws-deploy.data.aws_subnets.private: Read complete after 1s [id=eu-central-1]
module.aws-deploy.aws_lb_listener_rule.main: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:882089634282:listener-rule/app/bekk-lb-ecs-dev/6d410fcf59ca9e6f/da09c5a7670ad5a8/bc07e8037c928025]
module.aws-deploy.aws_ecs_service.main: Refreshing state... [id=arn:aws:ecs:eu-central-1:882089634282:service/bekk-ecs-cluster-dev/bekk-arrangement-svc-dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.aws-deploy.aws_ecs_service.main will be updated in-place
  ~ resource "aws_ecs_service" "main" {
        id                                 = "arn:aws:ecs:eu-central-1:882089634282:service/bekk-ecs-cluster-dev/bekk-arrangement-svc-dev"
        name                               = "bekk-arrangement-svc-dev"
        tags                               = {
            "Terraform" = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:882089634282:task-definition/bekk-arrangement-svc-dev:29" -> (known after apply)
        # (14 unchanged attributes hidden)

      - load_balancer {
          - container_name   = "bekk-arrangement-svc-dev" -> null
          - container_port   = 80 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:eu-central-1:882089634282:targetgroup/dev-qEfYxm4Yp5ww8yLZNIUznb3WEco/05fced12fd9f0a78" -> null
        }
      + load_balancer {
          + container_name   = "bekk-arrangement-svc-dev"
          + container_port   = 80
          + target_group_arn = (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.aws-deploy.aws_ecs_task_definition.main must be replaced
-/+ resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:882089634282:task-definition/bekk-arrangement-svc-dev:29" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  ~ environment      = [
                        # (3 unchanged elements hidden)
                        {
                            name  = "Auth0__PERMISSION_CLAIM_TYPE"
                            value = "https://api.bekk.no/claims/permission"
                        },
                      + {
                          + name  = "Config__Employee_Svc_url"
                          + value = "https://api.bekk.dev/employee-svc"
                        },
                        {
                            name  = "PORT"
                            value = "80"
                        },
                        # (2 unchanged elements hidden)
                    ]
                    name             = "bekk-arrangement-svc-dev"
                    # (8 unchanged elements hidden)
                } # forces replacement,
              ~ {
                  - cpu                   = 0 -> null
                  - environment           = [] -> null
                  - mountPoints           = [] -> null
                    name                  = "log_router"
                  - portMappings          = [] -> null
                  - user                  = "0" -> null
                  - volumesFrom           = [] -> null
                    # (4 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "bekk-arrangement-svc-dev" -> (known after apply)
      ~ revision                 = 29 -> (known after apply)
        tags                     = {
            "Name"      = "bekk-arrangement-svc-dev"
            "Terraform" = "true"
        }
        # (9 unchanged attributes hidden)
    }

  # module.aws-deploy.aws_lb_listener_rule.main will be updated in-place
  ~ resource "aws_lb_listener_rule" "main" {
        id           = "arn:aws:elasticloadbalancing:eu-central-1:882089634282:listener-rule/app/bekk-lb-ecs-dev/6d410fcf59ca9e6f/da09c5a7670ad5a8/bc07e8037c928025"
        tags         = {}
        # (4 unchanged attributes hidden)

      ~ action {
          ~ target_group_arn = "arn:aws:elasticloadbalancing:eu-central-1:882089634282:targetgroup/dev-qEfYxm4Yp5ww8yLZNIUznb3WEco/05fced12fd9f0a78" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      - condition {
          - host_header {
              - values = [
                  - "api.bekk.dev",
                ] -> null
            }
        }
      + condition {
          + host_header {
              + values = [
                  + "skjer.bekk.dev",
                ]
            }
        }
      + condition {

          + path_pattern {
              + values = [
                  + "/*",
                ]
            }
        }
      - condition {

          - path_pattern {
              - values = [
                  - "/arrangement-svc*",
                ] -> null
            }
        }
    }

  # module.aws-deploy.aws_lb_target_group.main must be replaced
+/- resource "aws_lb_target_group" "main" {
      ~ arn                                = "arn:aws:elasticloadbalancing:eu-central-1:882089634282:targetgroup/dev-qEfYxm4Yp5ww8yLZNIUznb3WEco/05fced12fd9f0a78" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/dev-qEfYxm4Yp5ww8yLZNIUznb3WEco/05fced12fd9f0a78" -> (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:eu-central-1:882089634282:targetgroup/dev-qEfYxm4Yp5ww8yLZNIUznb3WEco/05fced12fd9f0a78" -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
      ~ name                               = "dev-qEfYxm4Yp5ww8yLZNIUznb3WEco" -> "arrangement-svc-dev" # forces replacement
      + preserve_client_ip                 = (known after apply)
      ~ protocol_version                   = "HTTP1" -> (known after apply)
        tags                               = {
            "Environment" = "dev"
            "Terraform"   = "true"
        }
        # (10 unchanged attributes hidden)

      ~ stickiness {
          ~ cookie_duration = 86400 -> (known after apply)
          + cookie_name     = (known after apply)
          ~ enabled         = false -> (known after apply)
          ~ type            = "lb_cookie" -> (known after apply)
        }

        # (1 unchanged block hidden)
    }

  # module.aws-deploy.aws_route53_record.main[0] will be created
  + resource "aws_route53_record" "main" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "skjer.bekk.dev"
      + type            = "A"
      + zone_id         = "Z04411953P8CDQG39NSHW"

      + alias {
          + evaluate_target_health = true
          + name                   = "bekk-lb-ecs-dev-2120065058.eu-central-1.elb.amazonaws.com"
          + zone_id                = "Z215JYRZR1TBD5"
        }
    }

Plan: 3 to add, 2 to change, 2 to destroy.

Changes to Outputs:
  ~ URL = "https://api.bekk.dev/arrangement-svc" -> "https://skjer.bekk.dev/"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @Bjorn-Strom, Action: `pull_request`*